app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "father"]]
---
  def create
    user = User.find_by(username: params[:session][:username].downcase)