app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
SELECT  "games".* FROM "games"  ORDER BY "games"."id" ASC LIMIT 1
---
  def index
    @father = User.all.first
    @son = User.all.last
    @game = Game.all.first